zephyrproject-rtos/zephyr/boards/nxp/mimxrt700_evk/nxp_gpu_interface.h
/*
 * Copyright 2019, 2024-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _nxp_gpu_interface_h_
#define _nxp_gpu_interface_h_

#ifdef CONFIG_VGLITE /* Process only if VGLite is enabled */

#include "fsl_clock.h"
#include "fsl_power.h"

/*
 * GPU (VG-Lite) resource definitions for RT700.
 * Values are derived from NXP SDK_25_09 (MIMXRT700).
 */
#define CLOCK_ID_GPU                     kCLOCK_Gpu
#define IRQ_ID_GPU                       VGPU_IRQn
#define GPU_REG_BASE                     0x40486000u
#define RESET_ID_GPU                     1U /* Placeholder */
#define POWERGATE_GPU_PG_DEV             1U /* Placeholder */
#define SPI1_GPU_CTL                     1U   /* Placeholder */

/* XSPI0 flash address range */
#define XSPI0_BASE_ADDR   0x28000000U
#define XSPI0_END_ADDR    0x2c000000U  /* 64 MB */

/* Check if address lies within a range */
static inline int in_range(uintptr_t a, uintptr_t lo, uintptr_t hi)
{
	return (a >= lo) && (a <= hi);
}

/* Check if address is in NOR (FlexSPI) region */
static inline int buf_is_nor(void *addr)
{
	uintptr_t a = (uintptr_t)addr;
	return in_range(a, XSPI0_BASE_ADDR, XSPI0_END_ADDR);
}

/* No uncached alias defined for FlexSPI */
static inline int buf_is_nor_un(void *addr)
{
	(void)addr;
	return 0;
}

/* GPU power gating not supported separately */
void soc_powergate_set(uint32_t powergate, bool enable)
{
	(void)powergate;
	(void)enable;
}

bool buf_is_psram_cache(void *addr)
{
	(void)addr;
	return false;
}

bool buf_is_psram(void *addr)
{
	(void)addr;
	return false;
}

/* GPU clock handled by DisplayMix clocks */
static inline void clk_set_rate(uint32_t clk_id, uint32_t rate_hz)
{
	POWER_DisablePD(kPDRUNCFG_APD_GPU);
	POWER_DisablePD(kPDRUNCFG_PPD_GPU);
	POWER_ApplyPD();

	/* VGPU clock enablement and divider selection */
	CLOCK_EnableClock(kCLOCK_MediaAccessRamArbiter0);
	CLOCK_EnableClock(kCLOCK_MediaAccessRamArbiter1);

	CLOCK_AttachClk(kFRO0_DIV1_to_VGPU);
	CLOCK_SetClkDiv(kCLOCK_DivVgpuClk, 1U);
}

/* Clock control */
static inline void acts_clock_peripheral_enable(uint32_t clk_id)
{
	CLOCK_EnableClock(clk_id);
}

static inline void acts_clock_peripheral_disable(uint32_t clk_id)
{
	CLOCK_DisableClock(clk_id);
}

/* Reset control */
static inline void acts_reset_peripheral_assert(uint32_t reset_id)
{
	(void)reset_id;
	RESET_ClearPeripheralReset(kVGPU_RST_SHIFT_RSTn);
}

static inline void acts_reset_peripheral_deassert(uint32_t reset_id)
{
	(void)reset_id;
}

/*
 * The SDRAM region on RT700 spans 6 MB starting at address 0x30080000
 * (0x3008_0000 – 0x3067_e000) and is treated as a single contiguous
 * memory block.
 *
 * No separate aliases are defined for different cacheability attributes,
 * so cacheability conversions (cacheable ↔ non-cacheable ↔ WT/NA) resolve
 * to the same physical address.
 *
 * The helper functions below provide a consistent abstraction for these
 * conversions, ensuring portability across platforms where different
 * cacheability mappings may exist.
 */

#define CACHEABLE_START   CONFIG_VGLITE_CACHEABLE_MEM_START
#define CACHEABLE_END     (CONFIG_VGLITE_CACHEABLE_MEM_START + CONFIG_VGLITE_CACHEABLE_MEM_SIZE - 1U)
#define SPI1_UNCACHE_ADDR CONFIG_VGLITE_UNCACHE_ADDR

/* --------------------------------------------------------------------
 * SPI cache operation codes (RT700 mapping)
 * --------------------------------------------------------------------
 */
typedef enum {
	SPI_CACHE_FLUSH_ALL = 1,         /* Clean entire D-Cache */
	SPI_CACHE_FLUSH_INVALID_ALL = 2, /* Clean + Invalidate entire D-Cache */
	SPI_WRITEBUF_FLUSH = 3           /* Clean buffer/D-Cache (optional case) */
} spi_cache_op_t;

/*
 * Cacheable → WT/NA cache (for GPU/CPU DMA)
 */
static inline void *cache_to_wt_wna_cache(void *addr)
{
	uintptr_t a = (uintptr_t)addr;

	if (a >= CACHEABLE_START && a <= CACHEABLE_END) {
		/* Already cacheable WT/NA region */
		return addr;
	}

	/* Outside cacheable range, map to WT/NA if needed */
	return NULL; /* or add logic if you have alias for WT/NA */
}

/*
 * WT/NA cache → normal cache
 */
static inline void *wt_wna_cache_to_cache(void *addr)
{
	uintptr_t a = (uintptr_t)addr;

	if (a >= CACHEABLE_START && a <= CACHEABLE_END) {
		return (void *)a; /* already cacheable */
	}

	return NULL; /* outside range */
}

/*
 * Cacheable → Non-cacheable
 */
static inline void *cache_to_uncache(void *addr)
{
	uintptr_t a = (uintptr_t)addr;
	/*
	 * Since uncacheable region is not defined,
	 * cache to uncache function returns cache address only
	 */
	if (a >= CACHEABLE_START && a <= CACHEABLE_END) {
		return (void *)a; /* No offset */
	}

	return NULL; /* already uncached or outside RAM */
}

/*
 * Non-cacheable → WT/NA cache
 */
static inline void *uncache_to_wt_wna_cache(void *addr)
{
	uintptr_t a = (uintptr_t)addr;

	return (void *)a; /* No offset */
}

/*
 * --------------------------------------------------------------------
 * Map SPI cache ops to global Cortex-M33 Cache maintenance on RT700
 * ------------------------------------------------------------------
 */
void spi1_cache_ops(spi_cache_op_t op, void *addr, size_t size)
{
	(void)addr; /* Not used for global ops */
	(void)size;

	switch (op) {
	case SPI_CACHE_FLUSH_ALL:
		XCACHE_CleanCache(XCACHE0);
		break;

	case SPI_CACHE_FLUSH_INVALID_ALL:
		XCACHE_CleanInvalidateCache(XCACHE0);
		break;

	case SPI_WRITEBUF_FLUSH:
		XCACHE_CleanCache(XCACHE0);
		break;

	default:
		/* Unsupported op on RT700 */
		break;
	}
}

#endif /* CONFIG_VGLITE */
#endif /* _nxp_gpu_interface_h_ */
